Revit 2024 API
BuiltInFailures.SiteFailures.GradingInSamePhase Property
 The Surface being Graded was created in the current Phase. Grading it will result in it being created and destroyed in the same Phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GradingInSamePhase { get; }
Visual Basic
Public Shared ReadOnly Property GradingInSamePhase As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GradingInSamePhase {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace